app/applicationServer/loverduck_app/app/controllers/api/authorizations_controller.rb

INSERT INTO `users` (`password`, `mail`, `access_token`, `created_at`, `updated_at`) VALUES ('sihohaiku', 'shihokambara@gmail.com', 'mH63RKiFEBBa2ZshtXLXdrcq', '2017-10-29 01:04:14', '2017-10-29 01:04:14')
---
    def signup
      user = User.create!(mail: params[:mail], password: params[:password], name: params[:name], tel: params[:tel])

SELECT  `users`.* FROM `users` WHERE `users`.`mail` = 'shihokambara@gmail.com' AND `users`.`password` = 'sihohaiku' ORDER BY `users`.`id` ASC LIMIT 1
---
    def signin
        user = User.where(mail: params[:mail], password: params[:password]).first

UPDATE `users` SET `password` = 'nemuinemui', `updated_at` = '2017-10-29 01:47:36' WHERE `users`.`id` = 1
---
    def edit_password
      if current_user.password == params[:old_password]
        current_user.update(password: params[:new_password])