app/applicationServer/loverduck_app/app/controllers/api/ducks_controller.rb

INSERT INTO `ducks` (`unique_id`, `created_at`, `updated_at`, `address`, `name`, `postal_code`) VALUES ('kdlasfhewutrewrtjk3', '2017-10-29 02:40:17', '2017-10-29 02:40:17', '杉並区荻窪3-3-3', '祖父ダック', 1131111)
---
    def create
      duck = Duck.create(unique_id: params[:unique_id], postal_code: params[:postal_code], address: params[:address], password: params[:password], name: params[:name])

SELECT  `ducks`.* FROM `ducks` WHERE `ducks`.`id` = NULL LIMIT 1
---
    def detail
        duck = Duck.find(params[:duck_id])

SELECT  `ducks`.* FROM `ducks` WHERE `ducks`.`id` = 1 LIMIT 1
---
    def alertlog
      duck = Duck.find(params[:duck_id])