app/applicationServer/loverduck_app/app/controllers/alerts_controller.rb

SELECT  `ducks`.* FROM `ducks` WHERE `ducks`.`unique_id` = 'kdlasfhewutrewrtjk3' LIMIT 1
INSERT INTO `daily_logs` (`start_at`, `duck_id`, `created_at`, `updated_at`) VALUES ('2017-10-29 03:59:52', 3, '2017-10-29 03:59:52', '2017-10-29 03:59:52')
---
  def start_bath
    duck = Duck.find_by(unique_id: params[:unique_id])
    log = DailyLog.create(start_at: Time.now, duck_id: duck.id)

SELECT  `ducks`.* FROM `ducks` WHERE `ducks`.`unique_id` = 'kdlasfhewutrewrtjk3' LIMIT 1
SELECT  `daily_logs`.* FROM `daily_logs` WHERE `daily_logs`.`duck_id` = 3 AND `daily_logs`.`end_at` IS NULL ORDER BY `daily_logs`.`id` ASC LIMIT 1
UPDATE `daily_logs` SET `end_at` = '2017-10-29 04:01:27', `updated_at` = '2017-10-29 04:01:27' WHERE `daily_logs`.`id` = 3
---
  def finish_bath
    duck = Duck.find_by(unique_id: params[:unique_id])
    dailylog = DailyLog.where(duck_id: duck.id, end_at: nil).first
    dailylog.update(end_at: Time.now)

SELECT  `ducks`.* FROM `ducks` WHERE `ducks`.`unique_id` = ' qe3443rfq43' LIMIT 1
INSERT INTO `alerts` (`called_at`, `duck_id`, `created_at`, `updated_at`, `status`) VALUES ('2017-10-29 03:48:37', 3, '2017-10-29 03:48:37', '2017-10-29 03:48:37', 0)
---
  def create_alert
    duck = Duck.find_by(unique_id: params[:unique_id])
    alert = Alert.new(duck_id: duck.id, called_at: Time.now, status: 0 )
    if alert.save